tap "d12frosted/emacs-plus"
tap "koekeishiya/formulae"
tap "mat2cc/tap"
tap "remotemobprogramming/brew"
tap "sst/tap"
brew "coreutils"
brew "openssl@3"
brew "curl"
brew "exercism"
brew "fd"
brew "findutils"
brew "fontforge"
brew "fzf"
brew "gcc"
brew "gdbm"
brew "gemini-cli"
brew "git"
brew "gnu-sed"
brew "gnupg"
brew "gnuplot"
brew "graphviz"
brew "groff"
brew "helm"
brew "icu4c@76"
brew "jq"
brew "jump"
brew "k6"
brew "k9s"
brew "kubernetes-cli"
brew "lcov"
brew "libpq", link: true
brew "luarocks"
brew "make"
brew "mise"
brew "mongosh"
brew "moreutils"
brew "mysql-client", link: true
brew "tree-sitter@0.25"
brew "neovim"
brew "openssl@1.1"
brew "pandoc"
brew "pinentry-mac"
brew "qemu"
brew "reattach-to-user-namespace"
brew "redis"
brew "ripgrep"
brew "scrcpy"
brew "screen"
brew "telnet"
brew "tmux"
brew "trash-cli", link: true
brew "tree"
brew "weasyprint"
brew "wget"
brew "witr"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "d12frosted/emacs-plus/emacs-plus@30"
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"
brew "remotemobprogramming/brew/mob"
cask "alacritty"
cask "alfred"
cask "anki"
cask "appium-inspector"
cask "basictex"
cask "cloudflare-warp"
cask "cursor-cli"
cask "floorp"
cask "font-ibm-plex-serif"
cask "font-inter"
cask "gcloud-cli"
cask "grandperspective"
cask "intellij-idea"
cask "jordanbaird-ice"
cask "karabiner-elements"
cask "keyboard-cleaner"
cask "libreoffice"
cask "maccy"
cask "ngrok"
cask "obs"
cask "onyx"
cask "openvpn-connect"
cask "orbstack"
cask "pop-app"
cask "qbittorrent"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "readdle-spark"
cask "shottr"
cask "unshaky"
cask "vivaldi"
cask "vlc"
cask "whisky"
go "cmd/go"
go "cmd/gofmt"
