# Taps
tap "adoptopenjdk/openjdk"
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "mongodb/brew"

# System ( GNU stuffs, etc. )
brew "coreutils"
brew "curl"
brew "findutils"
brew "gawk"
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "make"
brew "moreutils"
brew "openssl@1.1"
brew "perl"
brew "screen"
brew "telnet"
brew "wget"

# Developer thingy
brew "asdf"
brew "git"
brew "kafka"
brew "mongodb/brew/mongodb-community"
brew "mysql"
brew "neovim"
brew "postgresql"
brew "redis", restart_service: true
cask "adoptopenjdk11"
cask "adoptopenjdk8"

# Prompt related things
brew "fzf"
brew "jq"
brew "jump"
brew "readline"
brew "reattach-to-user-namespace"
brew "starship"
brew "the_silver_searcher"
brew "tmux"
brew "trash-cli"
brew "tree"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
cask "alacritty"

# Flavours
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# Quicklook plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "webpquicklook"

# Casks ( Apps, etc. )
cask "alfred"
cask "android-file-transfer"
cask "brave-browser"
cask "discord"
cask "docker"
cask "dozer"
cask "drawio"
cask "flux"
cask "gifcapture"
cask "google-backup-and-sync"
cask "postman"
cask "iriunwebcam"
cask "karabiner-elements"
cask "notion"
cask "onyx"
cask "openvpn-connect"
cask "shift"
cask "slack"
cask "spotify"
cask "steelseries-engine"
cask "time-out"
