# Taps
tap "homebrew/bundle"
tap "homebrew/cask"
tap "homebrew/cask-drivers"
tap "homebrew/core"
tap "homebrew/services"
tap "koekeishiya/formulae"
tap "robotsandpencils/made"

# System ( GNU stuffs, etc. )
brew "coreutils"
brew "curl"
brew "findutils"
brew "gawk"
brew "gnu-sed"
brew "gnupg"
brew "grep"
brew "make"
brew "moreutils"
brew "openssl@1.1"
brew "openssl@3"
brew "perl"
brew "screen"
brew "telnet"
brew "wget"

# Developer thingy
brew "asdf"
brew "git"
brew "neovim"

# Prompt related things
brew "fzf"
brew "jq"
brew "jump"
brew "readline"
brew "reattach-to-user-namespace"
brew "starship"
brew "ripgrep"
brew "tmux"
brew "trash-cli"
brew "tree"
brew "zsh"
brew "zsh-autosuggestions"
brew "zsh-completions"
brew "zsh-syntax-highlighting"
brew "thefuck"
cask "alacritty"

# Flavours
brew "koekeishiya/formulae/skhd"
brew "koekeishiya/formulae/yabai"

# Quicklook plugins
cask "qlcolorcode"
cask "qlmarkdown"
cask "qlprettypatch"
cask "qlstephen"
cask "qlvideo"
cask "quicklook-csv"
cask "quicklook-json"
cask "quicklookase"
cask "webpquicklook"

# XCode
brew "xcodes"

# Casks ( Apps, etc. )
cask "alfred"
cask "google-chrome"
cask "arc"
cask "discord"
cask "docker"
cask "dozer"
cask "flux"
cask "karabiner-elements"
cask "notion"
cask "obsidian"
cask "onyx"
cask "openvpn-connect"
cask "postman"
cask "slack"
cask "spotify"
cask "steelseries-gg"
cask "time-out"
cask "unshaky"
cask "gather"
cask "google-cloud-sdk"
cask "libreoffice"
cask "miro"
cask "ngrok"
cask "offset-explorer"
cask "rar" # this is actually a CLI tool but they put it in `casks` wth is going on
cask "zoom"

# Disgusting, I just need the debugger ( since its hard to use debugger on vim )
# cask "visual-studio-code"
# UPDATE: fuck yeah, `nvim-dap` is awesome, go to hell vscode
